WB_VertCyl/WB_VertCyl_V5_VM/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-11;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-05;
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.001;
        value           uniform 1e-11;
    }

    GOWT
    {
        type            fixedValue;
        value           uniform 1e-11;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 0.001;
        value           uniform 1e-11;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 1e-11;
    }

    sides
    {
        type            slip;
    }
}


// ************************************************************************* //
